test/data/paymentManyToOne.json

{
  "id": "c9377529-d7df-4aa1-ae37-ad5148612003",
  "source_transfers":[{
    "id": "http://usd-ledger.example/USD/transfers/6851929f-5a91-4d02-b9f4-4ae6b7f1768c",
    "ledger":"http://usd-ledger.example/USD",
    "debits":[{
      "amount":"5.32",
      "account":"http://usd-ledger.example/accounts/alice"
    }],
    "credits":[{
      "amount":"5.32",
      "account":"http://usd-ledger.example/accounts/mark"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:11.000Z",
    "state": "prepared"
  }, {
    "id": "http://cad-ledger.example:1000/CAD/transfers/e042b737-8f20-40f0-87aa-e5b186512064",
    "ledger":"http://cad-ledger.example:1000/CAD",
    "debits":[{
      "amount":"6.80",
      "account":"http://cad-ledger.example/accounts/alice"
    }],
    "credits":[{
      "amount":"6.80",
      "account":"http://cad-ledger.example:1000/accounts/mark"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:11.000Z",
    "state": "prepared"
  }],
  "destination_transfers":[{
    "id": "http://eur-ledger.example/EUR/transfers/c92f2a2c-b21d-4e6c-96e7-4f6d6df4bee9",
    "ledger":"http://eur-ledger.example/EUR",
    "debits":[{
      "amount":"10.00",
      "account":"http://eur-ledger.example/accounts/mark"
    }],
    "credits":[{
      "amount":"10.00",
      "account":"http://eur-ledger.example/accounts/bob"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:10.000Z",
    "state": "proposed"
  }]
}
