test/data/paymentOneToMany.json

{
  "id": "c9377529-d7df-4aa1-ae37-ad5148612003",
  "source_transfers":[{
    "id": "http://usd-ledger.example/transfers/6851929f-5a91-4d02-b9f4-4ae6b7f1768c",
    "ledger":"http://usd-ledger.example",
    "debits":[{
      "amount":"10",
      "account":"http://usd-ledger.example/accounts/alice"
    }],
    "credits":[{
      "amount":"10",
      "account":"http://usd-ledger.example/accounts/mark"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:12.000Z",
    "state": "prepared"
  }],
  "destination_transfers":[{
    "id": "http://eur-ledger.example/transfers/c92f2a2c-b21d-4e6c-96e7-4f6d6df4bee9",
    "ledger":"http://eur-ledger.example",
    "debits":[{
      "amount":"4.87",
      "account":"http://eur-ledger.example/accounts/mark"
    }],
    "credits":[{
      "amount":"4.87",
      "account":"http://eur-ledger.example/accounts/bob"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:10.000Z",
    "state": "proposed"
  }, {
    "id": "http://cny-ledger.example/transfers/08cde216-e338-4be0-a373-143838349dc2",
    "ledger":"http://cny-ledger.example",
    "debits":[{
      "amount":"30",
      "account":"http://cny-ledger.example/accounts/mark"
    }],
    "credits":[{
      "amount":"30",
      "account":"http://cny-ledger.example/accounts/danielle"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:10.000Z",
    "state": "proposed"
  }]
}
