test/data/paymentSameExecutionCondition.json

{
  "id": "c9377529-d7df-4aa1-ae37-ad5148612003",
  "source_transfers":[{
    "id": "http://usd-ledger.example/USD/transfers/6851929f-5a91-4d02-b9f4-4ae6b7f1768c",
    "ledger":"http://usd-ledger.example/USD",
    "debits":[{
      "amount":"1.07",
      "account":"http://usd-ledger.example/accounts/alice"
    }],
    "credits":[{
      "amount":"1.07",
      "account":"http://usd-ledger.example/accounts/mark"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:11.000Z",
    "state": "prepared"
  }],
  "destination_transfers":[{
    "id": "http://eur-ledger.example/EUR/transfers/c92f2a2c-b21d-4e6c-96e7-4f6d6df4bee9",
    "ledger":"http://eur-ledger.example/EUR",
    "debits":[{
      "amount":"1.00",
      "account":"http://eur-ledger.example/accounts/mark"
    }],
    "credits":[{
      "amount":"1.00",
      "account":"http://eur-ledger.example/accounts/bob"
    }],
    "execution_condition": "cc:0:3:vmvf6B7EpFalN6RGDx9F4f4z0wtOIgsIdCmbgv06ceI:7",
    "expires_at": "2015-06-16T00:00:10.000Z",
    "state": "proposed"
  }]
}
